import styles from "./Footer.module.scss";
import column_logo from "../../../../public/column_logo.png";
import Image from "next/image";
import { Link } from "@mui/material";

const Footer = () => {
  return (
    <div className={styles.footer}>
      <div className={styles.footer_top}>
        <Image width={228} alt="image" src={column_logo} />
        <div className={styles.footer_top_right}>
          <div className={styles.footer_block_item}>
            <p className={styles.item_title}>Навигация</p>
            <Link href={"/"} className={styles.item_link}>
              О Нас
            </Link>
            <Link href={"/"} className={styles.item_link}>
              Новости
            </Link>
            <Link href={"/"} className={styles.item_link}>
              Каталог
            </Link>
            <Link href={"/"} className={styles.item_link}>
              Документы
            </Link>
            <Link href={"/"} className={styles.item_link}>
              Доставка
            </Link>
          </div>
          <div className={styles.footer_block_item}>
            <p className={styles.item_title}>Контакты</p>
            <div className={styles.icons}>
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M19.65 4.1052L1.93388 10.6219C0.724822 11.0851 0.731816 11.7285 1.71205 12.0154L6.2605 13.3689L16.7843 7.03519C17.2819 6.74638 17.7365 6.90175 17.3628 7.21819L8.83648 14.5584H8.83448L8.83648 14.5594L8.52273 19.0315C8.98237 19.0315 9.18521 18.8304 9.44301 18.5931L11.6523 16.5438L16.2477 19.7817C17.095 20.2268 17.7036 19.998 17.9144 19.0334L20.931 5.47202C21.2398 4.29107 20.4584 3.75635 19.65 4.1052Z"
                  fill="#EFF0F0"
                />
              </svg>
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M8.625 3C5.5184 3 3 5.5184 3 8.625V15.375C3 18.4816 5.5184 21 8.625 21H15.375C18.4816 21 21 18.4816 21 15.375V8.625C21 5.5184 18.4816 3 15.375 3H8.625ZM5.8125 8.0625C5.91114 12.9789 8.44829 15.9375 12.6289 15.9375H12.8715V13.1249C14.3933 13.2822 15.5295 14.4412 15.993 15.9375H18.1875C17.592 13.6991 16.0479 12.4615 15.0882 11.9887C16.0479 11.4039 17.4043 9.98624 17.724 8.0625H15.7282C15.3085 9.62615 14.0625 11.0438 12.8715 11.1785V8.0625H10.8416V13.519C9.60673 13.2066 7.99589 11.674 7.92988 8.0625H5.8125Z"
                  fill="#EFF0F0"
                />
              </svg>
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M13.6559 8.87699C13.6527 7.95844 12.9202 7.22718 12.0023 7.22634C11.0767 7.22536 10.3376 7.96991 10.3447 8.89685C10.3516 9.8119 11.0904 10.538 12.0108 10.5346C12.9285 10.5314 13.659 9.7954 13.6559 8.87699Z"
                  fill="#EFF0F0"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M8 3C5.23858 3 3 5.23858 3 8V16C3 18.7614 5.23858 21 8 21H16C18.7614 21 21 18.7614 21 16V8C21 5.23858 18.7614 3 16 3H8ZM11.9751 12.26C10.1257 12.2537 8.60917 10.7225 8.61995 8.87251C8.6306 7.00212 10.1481 5.49484 12.0157 5.50001C13.8871 5.50505 15.3892 7.03401 15.3799 8.92385C15.3703 10.77 13.8433 12.2664 11.9751 12.26ZM11.3606 14.7838C10.3536 14.6822 9.4456 14.4422 8.66824 13.8538C8.649 13.8392 8.62963 13.8247 8.61026 13.8102C8.53262 13.7521 8.45455 13.6937 8.38418 13.6283C8.04393 13.3121 8.00965 12.9499 8.27888 12.5767C8.5092 12.2573 8.89584 12.1719 9.29772 12.3553C9.37554 12.3908 9.44968 12.4352 9.5207 12.4828C10.9694 13.4461 12.9596 13.4727 14.4138 12.5261C14.5579 12.4192 14.7119 12.3321 14.8904 12.2876C15.2374 12.2014 15.5611 12.3247 15.7473 12.6186C15.9601 12.9541 15.9574 13.2817 15.6952 13.5422C15.2931 13.9416 14.8094 14.2306 14.2721 14.4323C13.7639 14.6229 13.2074 14.7189 12.6565 14.7826L12.7123 14.8416C12.7604 14.8925 12.792 14.926 12.8308 14.9637C13.1033 15.2287 13.3763 15.4933 13.6492 15.7578C14.1254 16.2194 14.6016 16.681 15.0755 17.1446C15.3295 17.3932 15.3826 17.7014 15.2427 17.9905C15.0898 18.3064 14.7475 18.5143 14.4119 18.4921C14.1993 18.4778 14.0334 18.3754 13.8861 18.2318C13.7011 18.0517 13.515 17.8726 13.3289 17.6936C12.9471 17.3264 12.5654 16.9591 12.1936 16.5826C12.0326 16.4198 11.9552 16.4506 11.8132 16.592C11.2453 17.1577 10.6682 17.7147 10.0877 18.2685C9.82707 18.5172 9.51689 18.562 9.2146 18.4199C8.89326 18.2692 8.68878 17.9518 8.70456 17.6328C8.71545 17.417 8.8251 17.2522 8.97815 17.1044C9.57449 16.5281 10.1695 15.9507 10.7644 15.3734L11.195 14.9556C11.2251 14.9263 11.2539 14.8958 11.2882 14.8596C11.3096 14.837 11.3332 14.812 11.3606 14.7838Z"
                  fill="#EFF0F0"
                />
              </svg>
            </div>
            <Link href={"tel:+73433465221"} className={styles.item_link}>
              +7 (343) 346-52-21
            </Link>
            <Link
              href={"mailto:uralmetizpro@yandex.ru"}
              className={styles.item_link}
            >
              uralmetizpro@yandex.ru
            </Link>
          </div>
        </div>
      </div>
      <div className={styles.footer_bottom}>
        <p className={styles.copyright}>
          © Компания по продаже самого крепкого крепежа «ТПА-Крепеж»
        </p>
        <p className={styles.author}>
          Created by <span className={styles.bolder}>koka team</span>
        </p>
      </div>
    </div>
  );
};

export default Footer;
